saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.LPC1700_DFP.2.5.0.pdsc
      </sequences>

      <!-- ************************  Subfamily 'LPC175x'  **************************** -->
      <subFamily DsubFamily="LPC175x">
        <feature type="ADC"           n="6"       m="12"/>
        <feature type="IOs"           n="52"/>
        <feature type="SPI"           n="1"/>
        <feature type="MPSerial"      n="2"                           name="SSP"/>
        <feature type="USART"         n="4"/>
        <feature type="USBD"          n="1"/>

      <!-- *************************  Device 'LPC1751'  ***************************** -->
      <device Dname="LPC1751">
        <processor Dclock="100000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1759_58_56_54_52_51.pdf"     title="LPC175x Data Sheet"/>
        <feature type="CAN"           n="1"/>
      </device>

      <!-- *************************  Device 'LPC1752'  ***************************** -->
      <device Dname="LPC1752">
        <processor Dclock="100000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1759_58_56_54_52_51.pdf"     title="LPC175x Data Sheet"/>
        <feature type="CAN"           n="1"/>
      </device>

      <!-- *************************  Device 'LPC1754'  ***************************** -->
      <device Dname="LPC1754">
        <processor Dclock="100000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_128.FLM"    start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1759_58_56_54_52_51.pdf"     title="LPC175x Data Sheet"/>
        <feature type="CAN"           n="1"/>
      </device>

      <!-- *************************  Device 'LPC1756'  ***************************** -->
      <device Dname="LPC1756">
        <processor Dclock="100000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_256.FLM"    start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1759_58_56_54_52_51.pdf"     title="LPC175x Data Sheet"/>
        <feature type="CAN"           n="2"/>
      </device>

      <!-- *************************  Device 'LPC1758'  ***************************** -->
      <device Dname="LPC1758">
        <processor Dclock="100000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1759_58_56_54_52_51.pdf"     title="LPC175x Data Sheet"/>
        <feature type="CAN"           n="2"/>
        <feature type="ETH"           n="1"       m="100000000"/>
      </device>

      <!-- *************************  Device 'LPC1759'  ***************************** -->
      <device Dname="LPC1759">
        <processor Dclock="120000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1759_58_56_54_52_51.pdf"     title="LPC175x Data Sheet"/>
        <feature type="CAN"           n="2"/>
      </device>
      </subFamily>

