saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.LPC1700_DFP.2.5.0.pdsc
        <!-- device configuration for LPC17xx -->
        <file category="header" condition="LPC1700 CMSIS Device" name="RTE_Driver/Config/RTE_Device.h" attr="config" version="2.4.1"/>

        <!-- device configuration for LPC177x_8x -->
        <file category="header" condition="LPC177x_8x CMSIS Device" name="RTE_Driver/Config_LPC177x_8x/RTE_Device.h" attr="config" version="2.3.2"/>

      </files>
    </component>

    <component Cclass="Device" Cgroup="PIN" Cversion="1.0.0" condition="LPC1700 CMSIS Device">
      <description>Pin Connect driver used by RTE Drivers for LPC1700 Series</description>
      <files>
        <file category="header" name="RTE_Driver/PIN_LPC17xx.h"/>
        <file category="source" name="RTE_Driver/PIN_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="PIN" Cversion="1.1.0" condition="LPC177x_8x CMSIS Device">
      <description>Pin Connect driver used by RTE Drivers for LPC177x_8x Series</description>
      <files>
        <file category="header" name="RTE_Driver/PIN_LPC177x_8x.h"/>
        <file category="source" name="RTE_Driver/PIN_LPC177x_8x.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="GPIO" Cversion="1.1.0" condition="LPC1700 CMSIS Device">
      <description>GPIO driver used by RTE Drivers for LPC17xx Series</description>
      <files>
        <file category="header" name="RTE_Driver/GPIO_LPC17xx.h"/>
        <file category="source" name="RTE_Driver/GPIO_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="GPIO" Cversion="1.1.0" condition="LPC177x_8x CMSIS Device">
      <description>GPIO driver used by RTE Drivers for LPC17xx Series</description>
      <files>
        <file category="header" name="RTE_Driver/GPIO_LPC17xx.h"/>
        <file category="source" name="RTE_Driver/GPIO_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="GPDMA" Cversion="1.2.0" condition="LPC17xx CMSIS Device">
      <description>GPDMA driver used by RTE Drivers for LPC1700 Series</description>
      <files>
        <file category="header" name="RTE_Driver/GPDMA_LPC17xx.h"/>
        <file category="source" name="RTE_Driver/GPDMA_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="CAN" Capiversion="1.0.0" Cversion="1.4.0" condition="LPC17xx CAN">
      <description>CAN Driver for the LPC17xx series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_CAN1                /* Driver CAN1 */
        #define RTE_Drivers_CAN2                /* Driver CAN2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/CAN_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Capiversion="2.1.0" Cversion="2.12.0" condition="LPC17xx USBD">
      <description>USB Device Driver for the LPC17xx series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBD_LPC17xx.c"/>
        <file category="source" name="RTE_Driver/OTG_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Host" Capiversion="2.1.0" Cversion="2.5.0" condition="LPC17xx USBH">
      <description>USB OHCI Host Driver for the LPC17xx series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBH_LPC17xx.c"/>
        <file category="source" name="RTE_Driver/OTG_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="SSP" Capiversion="2.1.0" Cversion="2.7.0" condition="LPC1700 CMSIS PIN GPIO GPDMA">
      <description>SPI Driver for LPC17xx Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI0                /* Driver SPI0 */
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/SSP_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="SSP" Capiversion="2.1.0" Cversion="2.7.0" condition="LPC177x_8x CMSIS PIN GPIO GPDMA">
      <description>SPI Driver for LPC177x_8x Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI0                /* Driver SPI0 */
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/SSP_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="SPI" Capiversion="2.1.0" Cversion="2.1.0" condition="LPC1700 CMSIS PIN GPIO">
      <description>SPI Driver for LPC17xx Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/SPI_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2.0" Cversion="2.5.0" condition="LPC17xx CMSIS PIN">
      <description>I2C Driver for LPC17xx Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_I2C0                /* Driver I2C0 */
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2C_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SAI" Capiversion="1.0.0" Cversion="1.2.0" condition="LPC17xx CMSIS PIN GPDMA">
      <description>SAI Driver for LPC17xx Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SAI0                /* Driver SAI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2S_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.1.0" Cversion="2.6.0" condition="LPC1700 CMSIS PIN GPDMA">
      <description>UART Driver for LPC1700 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART0              /* Driver USART0 */
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/UART_LPC17xx.c"/>
      </files>
    </component>
